ezois_ka/oooezoiskaobmen/src/Documents/ДокументацияПоКонтролируемымСделкам/ДокументацияПоКонтролируемымСделкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументацияПоКонтролируемымСделкам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОКонтролируемойСделке</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФайлаУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МетодыЦенообразования</name>
    <attributes>
      <name>ПорядковыеНомераСделок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтороныСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипВзаимозависимости</name>
      <type>
        <types>EnumRef.ТипыВзаимозависимости</types>
      </type>
    </attributes>
    <attributes>
      <name>КодМетодаЦенообразования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваЦенообразования</name>
    <attributes>
      <name>ИдентификаторСтрокиМетода</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КодМетодаЦенообразования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникИнформацииСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКотировкиСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокПримененияКотировкиСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокументаЦеныСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКорректировкиДляСопоставимостиСопоставимыхЦен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРентабельности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТестируемаяСторона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Рентабельность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РыночнаяРентабельность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеМетодаРаспределенияПрибыли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложения</name>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыПриложения</name>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.ДокументацияПоКонтролируемымСделкамПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Documents/ДокументацияПоКонтролируемымСделкам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьЛишниеДанныеМетодовЦенообразования();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения, Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// При копировании не нужно сохранять приложенные документы.
	// Т.к. файл из ФайлыПриложения ссылается на присоединенные файлы другого объекта.
	Приложения.Очистить();
	ФайлыПриложения.Очистить();
	
	ЗаполнениеДокументов.ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выгружает документ и возвращает свойства файла выгрузки.
//
// Параметры:
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификаторформы клиентского приложения.
//
// Возвращаемое значение:
//	 - Массив из Структура:
//		* АдресФайлаВыгрузки - Строка - адрес двоичных данных файла выгрузки во временном хранилище.
//		* ИмяФайлаВыгрузки - Строка - короткое имя файла выгрузки (с расширением).
//
Функция ВыгрузитьДокумент(УникальныйИдентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновныеСведенияВыгрузки = Документы.ДокументацияПоКонтролируемымСделкам.ОсновныеСведенияДокументацииДляВыгрузки(Ссылка);
	
	Если ОсновныеСведенияВыгрузки.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ВызватьИсключение НСтр("ru='Формат ФНС не предусматривает передачу документации по контролируемым сделкам физическими лицами'");
	КонецЕсли;
	
	ДатаАктуальностиСведений = КонецГода(ОтчетныйГод);
	
	ДанныеДокументации = Документы.ДокументацияПоКонтролируемымСделкам.ДанныеДокументацииДляВыгрузки(Ссылка, ДатаАктуальностиСведений);
	
	ФайлыВХранилище = КонтролируемыеСделкиВыгрузка.ФайлВыгрузкиДокументацииКС(ОсновныеСведенияВыгрузки, ДанныеДокументации, УникальныйИдентификатор);
	
	Возврат ФайлыВХранилище;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьЛишниеДанныеМетодовЦенообразования()
	
	ИдентификаторыМетодовЦенообразования = Новый Соответствие;
	Для Каждого СтрокаМетода Из МетодыЦенообразования Цикл
		ИдентификаторыМетодовЦенообразования.Вставить(СтрокаМетода.ИдентификаторСтроки, Новый Массив);
	КонецЦикла;
	
	// Удаляем те записи в СвойстваЦенообразования, в которых идентификатор указывает на метод, которого нет.
	// Если есть - то сохраняем для обработки.
	ИндексСтроки = СвойстваЦенообразования.Количество() - 1;
	Пока ИндексСтроки >=0 Цикл
		
		СтрокаСвойствЦенообразования = СвойстваЦенообразования[ИндексСтроки];
		
		ЗначениеСоответствия = ИдентификаторыМетодовЦенообразования.Получить(
			СтрокаСвойствЦенообразования.ИдентификаторСтрокиМетода);
		Если ЗначениеСоответствия = Неопределено Тогда
			СвойстваЦенообразования.Удалить(ИндексСтроки);
		Иначе
			ЗначениеСоответствия.Добавить(СтрокаСвойствЦенообразования);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки - 1;
		
	КонецЦикла;
	
	// Нужно проверить, что для каждой строки МетодыЦенообразования
	// нужное количество строк свойств. Если их больше - то нужно удалить.
	// Такое может быть в случае, если пользователь что-то активно редактировал в таблице.
	Для Каждого СтрокаМетода Из МетодыЦенообразования Цикл
		
		СтрокиСвойств = ИдентификаторыМетодовЦенообразования.Получить(СтрокаМетода.ИдентификаторСтроки);
		Если Не ЗначениеЗаполнено(СтрокиСвойств) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаМетода.КодМетодаЦенообразования) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаМетода.КодМетодаЦенообразования <> КонтролируемыеСделкиЦенообразование.КодМетодаКомбинацияМетодов() Тогда
			// Для всех вариантов, кроме комплексного, в таблице свойств должна быть только одна строка в СвойстваЦенообразования.
			// И код метода ценообразования в ней должен совпадать с кодом в строке МетодыЦенообразования.
			// Все несовпадающие строки нужно удалить.
			СтрокаКодаМетодаНайдена = Ложь;
			Для Каждого СтрокаСвойств Из СтрокиСвойств Цикл
				Если Не СтрокаКодаМетодаНайдена
					И СтрокаМетода.КодМетодаЦенообразования = СтрокаСвойств.КодМетодаЦенообразования Тогда
					СтрокаКодаМетодаНайдена = Истина;
					Продолжить;
				КонецЕсли;
				
				СвойстваЦенообразования.Удалить(СвойстваЦенообразования.Индекс(СтрокаСвойств));
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
